content/diary.org
#+TITLE:日記
#+options: toc:nil num:nil \n:t
#+LANGUAGE: ja
[[file:index.org][トップへ戻る]]
* 2026年1月
** [2026-01-04 Sun]
気がつけば2025年が終わり新年を迎えたので，重い腰を上げて，ホームページを立ち上げたの巻．
今までも何度かホームページやブログを立ち上げたものの，更新するためにhtmlを弄ったり，ブログにログインしてあれこれするのが面倒だったため，常に三日坊主に終わっていた．
今回，EmacsのOrg-modeを使った簡単ホームページ術に挑んでみて，チャッピー（M365 Copilotに入っていたGPT-5.2）と相談しながらやった結果，なんか思い通りの環境を作ることができたため，調子に乗ってホームページを公開してみるに至れり．
今まで通りの三日坊主にならないように，頑張っていきたい所存……（フラグではない）．

[[file:index.org][トップへ戻る]]
