docs/diary.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="ja" xml:lang="ja">
<head>
<!-- 2026-01-04 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>日記</title>
<meta name="author" content="藤本教寛" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="static/css/style.css" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">日記</h1>
<p>
<a href="index.html">トップへ戻る</a><br />
</p>
<div id="outline-container-org25aecf3" class="outline-2">
<h2 id="org25aecf3">2026年1月</h2>
<div class="outline-text-2" id="text-org25aecf3">
</div>
<div id="outline-container-org9c3fcf2" class="outline-3">
<h3 id="org9c3fcf2">2026-01-04 Sun</h3>
<div class="outline-text-3" id="text-org9c3fcf2">
<p>
気がつけば2025年が終わり新年を迎えたので，重い腰を上げて，ホームページを立ち上げたの巻．<br />
今までも何度かホームページやブログを立ち上げたものの，更新するためにhtmlを弄ったり，ブログにログインしてあれこれするのが面倒だったため，常に三日坊主に終わっていた．<br />
今回，EmacsのOrg-modeを使った簡単ホームページ術に挑んでみて，チャッピー（M365 Copilotに入っていたGPT-5.2）と相談しながらやった結果，なんか思い通りの環境を作ることができたため，調子に乗ってホームページを公開してみるに至れり．<br />
今まで通りの三日坊主にならないように，頑張っていきたい所存……（フラグではない）．<br />
</p>

<p>
<a href="index.html">トップへ戻る</a><br />
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="postamble">&copy; 藤本教寛（沖縄高専） / Yukihiro Fujimoto (Okinawa KOSEN) &nbsp;|&nbsp; 最終更新: 2026-01-04</p>
</div>
</body>
</html>
